a = 3
b = 2

print("파이썬에 있는 사칙 연산자들")
print("'+', '-', '*'")
print("각 각 나누기, 몫, 나머지 '/', '//', '%'")
print("추가로 거듭제곱 연산자 '**'")

print("대입 연산자들과 같이 사용할 수 있다.")
print(f"ex) {a} += 1 -> {a}")
print("이런식으로, 사칙 연산자 + 대입 연산자 '='를 같이 사용할 수 있고,")
print("이렇게 사용하면 a = a + 1 보다 더 적은 하드웨어 리소스를 사용한다.")

print("비트 연산자들은 두 2진수 값들을 비교하는 연산자들이다.")
print("AND 비트 연산자는 '&'로 둘 다 1이면 1을 반환한다.")
print("ex) 0101 & 1111 = 0101")
print("OR 연산자는 '|'로 둘 중 하나가 1이면 1을 반환한다.")
print("ex) 0101 | 1111 = 1111")
print("XOR 연산자는 '^'로 두 값이 서로 다르면 1을 반환한다.")
print("ex) 0101 | 1111 = 1010")
print("NOT 연산자는 '~'로 2진수 값을 그냥 반전시킨다.")
print("ex) ~0b0101 = 0b1010")